/*----------------------------------------------------------------------------------------------------
#	THIS FILE IS PART OF XEROLYSKINNER'S PROJECT
#
#	THIS PROGRAM IS FREE SOFTWARE
#
#	E-mail:ZABBCCCBBAZ@163.com
#	QQ:2715099320
#
#	Copyright (c) 2022 XerolySkinner
#	All rights reserved.
*/

/*----------------------------------------------------------------------------------------------------
	名字:vartable
	时间:
	程序员:梁源康
	说明:向量表
*/
#include "bsp_MM32F3277G9P.h"
#include "User.h"
#include "bsp_Console.h"
#include "stdio.h"
#ifndef _XEROLYSKINNER_VARTABLE_H
#define _XEROLYSKINNER_VARTABLE_H
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	程序
//	
int main(void);
//////////////////////////////////////////////////////////////////////////////////////////////////////
#endif
